// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1.
// Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// Решение:
/* 
string rec(int n)
{
    if (n == 1)
        return "1";
    return $"{n}, " + rec(n - 1);    
}
Console.Write("Введите элемент: "); 
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(rec(n));
 */
// _____________________________________________________________________________________________________________________________
// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

// Решение:
/* 
int rec(int m, int n)
{
    if (n == m)
        return m;
    return rec(m, n - 1) + n;
}
Console.Write("Введите элемент: "); 
int m = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите элемент: "); 
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(rec(m, n));
 */
// _____________________________________________________________________________________________________________________________
// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29

// Решение:

// _____________________________________________________________________________________________________________________________
/* 
int rec(int m, int n)
{
    if (m == 0) return n + 1;
        else if (n == 0) return rec(m - 1, 1);
            else return rec(m - 1, rec(m, n - 1));
}
Console.Write("Введите элемент: "); 
int m = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите элемент: "); 
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(rec(m, n));
 */
